[
    {
        "url": "https://books.toscrape.com/catalogue/why-save-the-bankers-and-other-essays-on-our-economic-and-political-crisis_418/index.html",
        "title": "Why Save the Bankers?: And Other Essays on Our Economic and Political Crisis",
        "upc": "759ee7d059b1beb8",
        "product_type": "books",
        "price_excl_tax": 48.67,
        "price_incl_tax": 48.67,
        "tax": 0.0,
        "availability": 5,
        "num_reviews": 0,
        "stars": 2,
        "category": "nonfiction",
        "description": [
            "Incisive commentary on the financial meltdown and its aftermath, from the author of the bestselling global phenomenonCapital in the Twenty-First Century Thomas Piketty's work has proved that unfettered markets lead to increasing inequality. Without meaningful regulation, capitalist economies will concentrate wealth in an ever smaller number of hands. Armed with this knowle Incisive commentary on the financial meltdown and its aftermath, from the author of the bestselling global phenomenon Capital in the Twenty-First Century Thomas Piketty's work has proved that unfettered markets lead to increasing inequality. Without meaningful regulation, capitalist economies will concentrate wealth in an ever smaller number of hands. Armed with this knowledge, democratic societies face a defining challenge: fending off a new aristocracy. For years, Piketty has wrestled with this problem in his monthly newspaper column, which pierces the surface of current events to reveal the economic forces underneath. Why Save the Bankers? brings together selected columns, now translated and annotated, from the period book-ended by the September 2008 collapse of Lehman Brothers and the Paris attacks of November 2015. In between, writing from the vantage point of his native France, Piketty brilliantly decodes the European sovereign debt crisis, an urgent struggle against the tyranny of markets that bears lessons for the world at large. And along the way, he weighs in on oligarchy in the United States, wonders whether debts actually need to be paid back, and discovers surprising lessons about inequality by examining the career of Steve Jobs. Coursing with insight and flashes of wit, these brief essays offer a view of recent history through the eyes of one of the most influential economic thinkers of our time. ...more"
        ],
        "price": 48.67
    }
]